<?php

/**
 * ===============================================
 * PHPCAN微服务框架 - fpm版本
 * ===============================================
 * 版本：PHP7.0 +
 * 作者: suruibuas / 317953536@qq.com
 * 日期: 2018/3/23 13:09
 * 官网：http://www.phpcan.cn
 * ===============================================
 * 客户端SDK配置文件
 * ===============================================
 */

return [
    // 网关地址
    'GATEWAY'     => '',
    // 当前环境 0 测试 1 生产
    'ENVIRONMENT' => 0,
    // 调用端 web、wap、android、iOS、pc、tv
    'CLIENT'      => '',
    // 开发者账号
    'UNAME'       => '',
    // 开发者密码
    'PWORD'       => '',
    // 最大超时时间，单位秒
    'TIMEOUT'     => 3,
    // 服务编排
    'COMPOSER'    => [
        
    ]
];